Tekla Open API Reference for Tekla Structures 2025
ControlPolycurve Constructor
Overload List
Name | Description
ControlPolycurve()
 Initializes a new instance of the ControlPolycurve class.
The default values are as follows:
Color = ControlObjectColorEnum.BLUE;
LineType = LineType.DashDot;
ControlPolycurve(Polycurve)
 Initializes a new instance of the ControlPolycurve class.
Top
See Also
Reference
ControlPolycurve Class
Tekla.Structures.Model Namespace